stress-test/artillery-config.yml
config:
  target: 'http://localhost:3002'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'
    # Ramp up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp up load'
    # Sustained load phase
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
    # Cool down phase
    - duration: 30
      arrivalRate: 10
      name: 'Cool down'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # Health check scenario
  - name: 'Health Check'
    weight: 10
    flow:
      - get:
          url: '/'
          name: 'Health Check'
          expect:
            - statusCode: 200

  # Public endpoints scenario
  - name: 'Public Resources'
    weight: 20
    flow:
      - get:
          url: '/resources/countries'
          name: 'Get Countries'
      - get:
          url: '/resources/categories'
          name: 'Get Categories'
      - get:
          url: '/resources/currencies'
          name: 'Get Currencies'

  # Product browsing scenario
  - name: 'Product Browsing'
    weight: 25
    flow:
      - get:
          url: '/products'
          name: 'Get Products'
          qs:
            page: '{{ $randomInt(1, 10) }}'
            limit: '{{ $randomInt(5, 20) }}'
      - get:
          url: '/products/{{ $randomInt(1, 100) }}'
          name: 'Get Product Details'

  # Authentication scenario
  - name: 'Authentication Flow'
    weight: 15
    flow:
      - post:
          url: '/auth/register'
          name: 'User Registration'
          json:
            email: 'testuser{{ $randomInt(1, 10000) }}@example.com'
            password: 'TestPassword123!'
            firstName: 'Test'
            lastName: 'User'
            country: 'US'
      - post:
          url: '/auth/login'
          name: 'User Login'
          json:
            email: 'testuser{{ $randomInt(1, 100) }}@example.com'
            password: 'TestPassword123!'

  # Cart operations scenario
  - name: 'Cart Operations'
    weight: 20
    flow:
      - post:
          url: '/auth/login'
          name: 'Login for Cart'
          json:
            email: 'testuser@example.com'
            password: 'TestPassword123!'
          capture:
            - json: '$.data.accessToken'
              as: 'accessToken'
      - post:
          url: '/cart/add'
          name: 'Add to Cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productId: '{{ $randomInt(1, 50) }}'
            quantity: '{{ $randomInt(1, 5) }}'
      - get:
          url: '/cart'
          name: 'Get Cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
      - post:
          url: '/cart/update'
          name: 'Update Cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productId: '{{ $randomInt(1, 50) }}'
            quantity: '{{ $randomInt(1, 3) }}'

  # Order creation scenario
  - name: 'Order Creation'
    weight: 10
    flow:
      - post:
          url: '/auth/login'
          name: 'Login for Order'
          json:
            email: 'testuser@example.com'
            password: 'TestPassword123!'
          capture:
            - json: '$.data.accessToken'
              as: 'accessToken'
      - post:
          url: '/cart/add'
          name: 'Add Item to Cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productId: '{{ $randomInt(1, 20) }}'
            quantity: 1
      - post:
          url: '/orders'
          name: 'Create Order'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            shippingAddress:
              firstName: 'Test'
              lastName: 'User'
              address: '123 Test Street'
              city: 'Test City'
              state: 'TS'
              postalCode: '12345'
              country: 'US'
            paymentMethod: 'card'