stress-test/artillery-soak-test.yml
config:
  target: 'http://localhost:3002'
  phases:
    # Ramp up to normal load
    - duration: 300 # 5 minutes
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp up'
    # Sustained load for extended period
    - duration: 1800 # 30 minutes
      arrivalRate: 50
      name: 'Sustained load'
    # Cool down
    - duration: 300 # 5 minutes
      arrivalRate: 10
      name: 'Cool down'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

scenarios:
  - name: 'Soak Test'
    weight: 40
    flow:
      - get:
          url: '/'
          name: 'Health Check'
      - get:
          url: '/resources/countries'
          name: 'Get Countries'
      - get:
          url: '/products'
          name: 'Get Products'
      - sleep: 2

  - name: 'Authentication Soak'
    weight: 30
    flow:
      - post:
          url: '/auth/login'
          name: 'Login'
          json:
            email: 'testuser@example.com'
            password: 'TestPassword123!'
      - sleep: 1

  - name: 'Cart Operations Soak'
    weight: 30
    flow:
      - post:
          url: '/auth/login'
          name: 'Login for Cart'
          json:
            email: 'testuser@example.com'
            password: 'TestPassword123!'
          capture:
            - json: '$.data.accessToken'
              as: 'accessToken'
      - post:
          url: '/cart/add'
          name: 'Add to Cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            productId: '{{ $randomInt(1, 50) }}'
            quantity: '{{ $randomInt(1, 3) }}'
      - get:
          url: '/cart'
          name: 'Get Cart'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
      - sleep: 3